app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1 AND "categories"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 7], ["LIMIT", 1]]
---
  def show
    @category = current_user.categories.find(params[:id])

INSERT INTO "categories" ("title", "details", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "this is your first category"], ["details", "FIIIIIIIIRST!"], ["created_at", "2022-10-25 23:55:01.349616"], ["updated_at", "2022-10-25 23:55:01.349616"], ["user_id", 1]]
---
  def create
    @category = current_user.categories.build(category_params)

    if @category.save

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def update
    @category = Category.find(params[:id])