app/controllers/tasks_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
INSERT INTO "tasks" ("title", "details", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "hello?"], ["details", "are you still working?"], ["category_id", 5], ["created_at", "2022-10-25 06:14:38.337587"], ["updated_at", "2022-10-25 06:14:38.337587"]]
---
    def create
        @category = Category.find(params[:category_id])
        @task = @category.tasks.create(task_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = $1 AND "tasks"."id" = $2 LIMIT $3  [["category_id", 5], ["id", 1], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]
---
    def destroy
        @category = Category.find(params[:category_id])
        @task = @category.tasks.find(params[:id])
        @task.destroy

SELECT "tasks".* FROM "tasks" INNER JOIN "categories" ON "tasks"."category_id" = "categories"."id" WHERE "categories"."user_id" = $1 AND "tasks"."deadline" = $2  [["user_id", 2], ["deadline", "2022-10-26"]]
---
    def due_today
        @due_today = current_user.tasks.where(deadline: Date.current)